tap 'caskroom/cask'

# for Vim
brew 'lua'
cask 'xquartz'
brew 'vim', args:['with-lua', 'with-perl', 'HEAD', 'override-system-vi']
brew 'neovim/neovim/neovim'

cask 'google-japanese-ime'

# for iOS
cask 'realm-browser'
brew 'swiftlint'
brew 'carthage'

# for Git
brew 'git-lfs'
brew 'gibo'

# for Github
cask 'trailer'

# for Terminal
brew 'wget'
brew 'coreutils'
brew 'reattach-to-user-namespace'
brew 'hub'
brew 'tmux'
brew 'sshrc'
tap 'tldr-pages/tldr'
brew 'tldr'
brew 'git-extras'
brew 'source-highlight'
brew 'jq'
brew 'terminal-notifier'


# for Life🐈
cask 'bettertouchtool'
cask 'karabiner'
cask 'atom'
cask 'dash'
#cask 'kobito'
#cask 'iterm2'


