# for Vim
brew 'lua'
# cask 'xquartz'
# brew 'vim', args:['with-lua', 'with-perl', 'HEAD', 'override-system-vi']
# brew 'vim', args:['with-lua', 'with-perl', 'with-python', 'override-system-vi']
brew 'vim'
#tap 'sanemat/font'
#brew 'ricty', args:['with-powerline']
tap 'tattn/formula'
cask 'font-ricty-diminished-for-powerline'

# tap 'neovim/neovim'
# brew 'neovim/neovim/neovim'

cask 'google-japanese-ime'

# for iOS
#cask 'realm-browser'
brew 'swiftlint'
brew 'carthage'
brew 'chisel'
tap 'keith/formulae'
brew 'keith/formulae/zsh-xcode-completions'

# for Git
#brew 'git-lfs'
brew 'gibo'

# for Github
#cask 'trailer'
cask 'jasper'

# for Terminal
brew 'wget'
brew 'coreutils'
brew 'reattach-to-user-namespace'
brew 'tree'
#brew 'hub'
brew 'tmux'
tap 'tldr-pages/tldr'
brew 'tldr'
brew 'git-extras'
brew 'source-highlight'
brew 'jq'
brew 'terminal-notifier'
brew 'ssh-copy-id'
#brew 'oath-toolkit'

# for Go
#brew 'go' # still in progress for M1 Mac

# for Flutter
tap 'dart-lang/dart'
brew 'dart'

# for Web Dev
#brew 'wrk'
#brew 'mitmproxy'

# for DB
cask 'sequel-pro'

# for Dev
brew 'zlib'
brew 'openssl'
brew 'readline'
brew 'xz'
cask 'sourcetree'
cask 'postman'

# for Life🐈
cask 'bettertouchtool'
cask 'karabiner-elements'
cask 'alfred'
#cask 'atom'
cask 'typora'
cask 'dash'
#cask 'clipy' # alfredに移行
cask 'skitch'
brew 'translate-shell'
#cask 'kobito'
#cask 'iterm2'
cask 'mark-text'
cask 'visual-studio-code'
cask 'docker'
cask 'keepingyouawake'

# for mac previews (https://github.com/sindresorhus/quick-look-plugins)
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
#cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

