tap 'caskroom/cask'

# for Vim
brew 'lua'
cask 'xquartz'
brew 'vim', args:['with-lua', 'with-perl', 'HEAD', 'override-system-vi']

tap 'neovim/neovim'
brew 'neovim/neovim/neovim'

cask 'google-japanese-ime'

# for iOS
cask 'realm-browser'
brew 'swiftlint'
brew 'carthage'
brew 'chisel'

# for Git
brew 'git-lfs'
brew 'gibo'

# for Github
cask 'trailer'

# for Terminal
brew 'wget'
brew 'coreutils'
brew 'reattach-to-user-namespace'
brew 'tree'
brew 'hub'
brew 'tmux'
brew 'sshrc'
tap 'tldr-pages/tldr'
brew 'tldr'
brew 'git-extras'
brew 'source-highlight'
brew 'jq'
brew 'terminal-notifier'
brew 'ssh-copy-id'

# for Go
brew 'go'

# for Web Dev
brew 'wrk'
brew 'mitmproxy'

# for DB
cask 'sequel-pro'

# for Life🐈
cask 'bettertouchtool'
cask 'karabiner'
cask 'atom'
cask 'typora'
cask 'dash'
cask 'clipy'
cask 'skitch'
brew 'translate-shell'
#cask 'kobito'
#cask 'iterm2'

# for mac previews (https://github.com/sindresorhus/quick-look-plugins)
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase qlvideo'

